@kov117 Plan shows metrics being disabled for me:

```terraform
  # module.grafana.azurerm_monitor_diagnostic_setting.this will be created
  + resource "azurerm_monitor_diagnostic_setting" "this" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "audit-logs"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "GrafanaLoginEvents"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false
        }
    }
```